Catalogs/ОсновныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ОсновныеСредства</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ОбъектыСтроительства</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изготовитель</Name>
					<Comment>(Общ) Организация-изготовитель</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автотранспорт</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияОСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОСОрганизаций</Name>
			<Comment>(Регл) Регистр, который показывает изменение состояний основных по бух. учету ОС. Данные вносятся только документами. По этому регистру ведется анализ даты принятия к учету, ввода в эксплуатацию, выбытия.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Comment>Дата установки состояния</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КодыОрганизации</Name>
			<Comment>Параметры регистрации и коды организации </Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрации</Name>
					<Comment>Номер регистрации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемЗарегистрирована</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрацииПФ</Name>
					<Comment>Номер регистрации в ПФ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрацииВСлужбеЗанятости</Name>
					<Comment>Номер регистрации в службе занятости</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяИнспекция</Name>
					<Comment>Налоговая инспекция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>Код ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Индивидуальный налоговый номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Comment>Номер свидетельства</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЗКГНГ</Name>
					<Comment>Код по ЗКГНГ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСПОДУ</Name>
					<Comment>Код по СПОДУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКВЕД</Name>
					<Comment>Код по КВЕД</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКОАТУУ</Name>
					<Comment>Код по КОАТУУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКФВ</Name>
					<Comment>Код КФВ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФСС</Name>
					<Comment>Номер регистрации ФСС от временной потери трудоспособности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФССНесчСлучай</Name>
					<Comment>Номер регистрации в ФСС от несчастного случая</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганГУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОПФГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПФГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОрганаПФУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеРабочегоОрганаФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОДиректораФонда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассПрофессиональногоРиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганСоциальнойЗащитыНаселения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФССУ</Name>
					<Comment>Номер регистрации ФСС Украины</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКАТОТТГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОсновныеСредства/Ext/ObjectModule.bsl
#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой инвентарной карточки ОС (форма ОЗ-6)
// Возвращаемое значение:
// Табличный документ - печатная форма инвентарной карточки ОС
Функция ПечатьОЗ6()
	
	Макет                       = ПолучитьМакет("ОЗ6");
	Шапка						= Макет.ПолучитьОбласть("Шапка");
	ШапкаМодернизацииИРемонта	= Макет.ПолучитьОбласть("ШапкаМодернизацииИРемонта");
	СтрокаМодернизацииИРемонта 	= Макет.ПолучитьОбласть("СтрокаМодернизацииИРемонта");
	Подвал						= Макет.ПолучитьОбласть("Подвал");

	ТабДок = Новый ТабличныйДокумент();
	Организация      = Неопределено;
	ДатаСведений     = КонецДня(РабочаяДата);
	
	cВидаУчета   = "Бухгалтерський";
	ВалютаПечати = глЗначениеПеременной("ВалютаРегламентированногоУчета").Наименование;
	ВидУчета 	 = "Бух";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОсновноеСредство", Ссылка);
	Запрос.УстановитьПараметр("ДатаСведений"    , ДатаСведений);
	Запрос.УстановитьПараметр("СостояниеВвода"  , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	Запрос.УстановитьПараметр("СостояниеВыбытия", Перечисления.СостоянияОС.СнятоСУчета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияОС.Организация                         КАК Организация,
	|	ПервоначальныеСведенияОС.Организация.НаименованиеПолное      КАК ОрганизацияНаименованиеПолное,
	|	ПервоначальныеСведенияОС.Организация.Наименование            КАК ОрганизацияНаименование,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеПолное,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.Наименование       КАК Наименование,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.Модель             КАК Модель,
	|	ПервоначальныеСведенияОС.ИнвентарныйНомер                    КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.ЗаводскойНомер     КАК ЗаводскойНомер,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.Изготовитель       КАК ИзготовительОС,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.НомерПаспорта      КАК НомерПаспорта,
	|	ПервоначальныеСведенияОС.ОсновноеСредство.ДатаВыпуска        КАК ДатаВыпуска,
	|	ПервоначальныеСведенияОС.ПервоначальнаяСтоимость             КАК ПервоначальнаяСтоимость,
	|	ВводВЭксплуатацию.ДатаСостояния                              КАК ДокументВводаВЭксплуатациюДата,
	|	ВводВЭксплуатацию.НомерДокумента                             КАК ДокументВводаВЭксплуатациюНомер,
	|	КодыОрганизации.КодПоЕДРПОУ                                  КАК ЕДРПОУ,
	|	ПРЕДСТАВЛЕНИЕ(ПеремещенияОС.Местонахождение)                 КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(ПеремещенияОС.СчетУчета)                       КАК СчетУчета,
	|	ПРЕДСТАВЛЕНИЕ(ПеремещенияОС.СчетНачисленияАмортизации)       КАК СчетАмортизации,
	|	ПеремещенияОС.ДатаВыбытия                                    КАК ДокументВыбытияДата,
	|	ПеремещенияОС.НомерДокумента                                 КАК ДокументВыбытияНомер,
	|	ПеремещенияОС.Период                                         КАК Период
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|	                &ДатаСведений, 
	|	                ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияОСОрганизаций КАК ВводВЭксплуатацию
	|		ПО ПервоначальныеСведенияОС.ОсновноеСредство = ВводВЭксплуатацию.ОсновноеСредство
	|			И ПервоначальныеСведенияОС.Организация = ВводВЭксплуатацию.Организация
	|			И (ВводВЭксплуатацию.Состояние = &СостояниеВвода)
	|			И (ВводВЭксплуатацию.ДатаСостояния <= &ДатаСведений)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(&ДатаСведений, ) КАК КодыОрганизации
	|		ПО ПервоначальныеСведенияОС.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ
	|				Перемещения.Организация КАК Организация,
	|				Перемещения.ОсновноеСредство КАК ОсновноеСредство,
	|				Перемещения.Местонахождение КАК Местонахождение,
	|				Перемещения.Период КАК Период,
	|				ЕСТЬNULL(Перемещения.ДатаВыбытия, СостоянияОС.ДатаСостояния) КАК ДатаВыбытия,
	|				ВЫБОР
	|					КОГДА Перемещения.ДатаВыбытия ЕСТЬ NULL 
	|						ТОГДА СостоянияОС.НомерДокумента
	|					ИНАЧЕ МестонахождениеОС.Регистратор.Номер
	|				КОНЕЦ КАК НомерДокумента,
	|				СчетаУчетаОС.СчетУчета КАК СчетУчета,
	|				СчетаУчетаОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации
	|			ИЗ
	|				(ВЫБРАТЬ
	|					МестонахождениеОС.Организация КАК Организация,
	|					МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
	|					МестонахождениеОС.Местонахождение КАК Местонахождение,
	|					МестонахождениеОС.Период КАК Период,
	|					МИНИМУМ(МестонахождениеОС1.Период) КАК ДатаВыбытия,
	|					МАКСИМУМ(СчетаУчетаОС.Период) КАК ДатаСчета
	|				ИЗ
	|					РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОС
	|						ЛЕВОЕ СОЕДИНЕНИЕ 
	|							РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОС1
	|						ПО МестонахождениеОС.Период < МестонахождениеОС1.Период
	|							И МестонахождениеОС.Организация = МестонахождениеОС1.Организация
	|							И МестонахождениеОС.ОсновноеСредство = МестонахождениеОС1.ОсновноеСредство
	|							И (МестонахождениеОС1.Период <= &ДатаСведений)
	|						ЛЕВОЕ СОЕДИНЕНИЕ 
	|							РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчетаОС
	|						ПО МестонахождениеОС.ОсновноеСредство = СчетаУчетаОС.ОсновноеСредство
	|							И МестонахождениеОС.Организация = СчетаУчетаОС.Организация
	|							И МестонахождениеОС.Период >= СчетаУчетаОС.Период
	|							И (СчетаУчетаОС.Период <= &ДатаСведений)
	|				ГДЕ
	|					МестонахождениеОС.ОсновноеСредство = &ОсновноеСредство
	|					И МестонахождениеОС.Период <= &ДатаСведений
	|			
	|				СГРУППИРОВАТЬ ПО
	|					МестонахождениеОС.Местонахождение,
	|					МестонахождениеОС.Период,
	|					МестонахождениеОС.Организация,
	|					МестонахождениеОС.ОсновноеСредство) КАК Перемещения
	|				ЛЕВОЕ СОЕДИНЕНИЕ 
	|					РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОС
	|				ПО Перемещения.ДатаВыбытия = МестонахождениеОС.Период
	|					И Перемещения.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|					И Перемещения.Организация = МестонахождениеОС.Организация
	|				ЛЕВОЕ СОЕДИНЕНИЕ 
	|					РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|				ПО Перемещения.ОсновноеСредство = СостоянияОС.ОсновноеСредство
	|					И Перемещения.Организация = СостоянияОС.Организация
	|					И (Перемещения.ДатаВыбытия ЕСТЬ NULL )
	|					И (СостоянияОС.Состояние = &СостояниеВыбытия)
	|					И (СостоянияОС.ДатаСостояния <= &ДатаСведений)
	|				ЛЕВОЕ СОЕДИНЕНИЕ 
	|					РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчетаОС
	|				ПО Перемещения.ОсновноеСредство = СчетаУчетаОС.ОсновноеСредство
	|					И Перемещения.Организация = СчетаУчетаОС.Организация
	|					И Перемещения.ДатаСчета = СчетаУчетаОС.Период) КАК ПеремещенияОС
	|		ПО ПервоначальныеСведенияОС.ОсновноеСредство = ПеремещенияОС.ОсновноеСредство
	|			И ПервоначальныеСведенияОС.Организация = ПеремещенияОС.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещенияОС.Период";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		
		СведенияОбОС = Результат.Выбрать();
		ПерваяСтрока = Истина;
		
		Пока СведенияОбОС.Следующий() Цикл
		
			Если ПерваяСтрока Тогда
				
				Шапка.Параметры.Заполнить(СведенияОбОС);
				Шапка.Параметры.НаименованиеОС          = ? (НЕ ЗначениеЗаполнено(СведенияОбОС.НаименованиеПолное),
				СведенияОбОС.Наименование, СведенияОбОС.НаименованиеПолное);
				Шапка.Параметры.ОрганизацияНаименование = ? (НЕ ЗначениеЗаполнено(СведенияОбОС.ОрганизацияНаименованиеПолное),
				СведенияОбОС.ОрганизацияНаименование, СведенияОбОС.ОрганизацияНаименованиеПолное);
				
				СтрокаМодернизацииИРемонта.Параметры.ИнвентарныйНомер = СведенияОбОС.ИнвентарныйНомер;
				Организация                                           = СведенияОбОС.Организация;
				
				ПерваяСтрока = Ложь;
				
				Шапка.Параметры.cВидаУчета = cВидаУчета;
				
				ТабДок.Вывести(Шапка);
				
				СтрокаПеремещения = Макет.ПолучитьОбласть("СтрокаПеремещения");
				СтрокаПеремещения.Параметры.Заполнить(СведенияОбОС);
				
				ТабДок.Вывести(СтрокаПеремещения);
				
			Иначе
				
				СтрокаПеремещения = Макет.ПолучитьОбласть("СтрокаПеремещения");
				СтрокаПеремещения.Параметры.Заполнить(СведенияОбОС);
				
				ТабДок.Вывести(СтрокаПеремещения);
				
			КонецЕсли;	
		
		КонецЦикла;
		
		ПодвалПеремещения = Макет.ПолучитьОбласть("ПодвалПеремещения");
		ТабДок.Вывести(ПодвалПеремещения);
		
	Иначе
		
		Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='На момент печати основное средство <%1> не принималось к учету."
"Нельзя сформировать инвентарную карточку объекта!';uk=""На момент друку основний засіб <%1> не приймався до обліку."
"Не можна сформувати інвентарну картку об'єкта!"""), Наименование),СтатусСообщения.Внимание);
		Возврат Неопределено;
		
	КонецЕсли;
	

	// Модернизация ОС и ремонт
	ТаблицаМодернизаций = Новый ТаблицаЗначений;
	ТаблицаМодернизаций.Колонки.Добавить("Дата");
	ТаблицаМодернизаций.Колонки.Добавить("Номер");
	ТаблицаМодернизаций.Колонки.Добавить("Сумма");
	
	ТаблицаРемонтов = Новый ТаблицаЗначений;
	ТаблицаРемонтов.Колонки.Добавить("Дата");
	ТаблицаРемонтов.Колонки.Добавить("Номер");
	ТаблицаРемонтов.Колонки.Добавить("Сумма");
	
	ШапкаМодернизацииИРемонта.Параметры.cВидаУчета = cВидаУчета;
	ТабДок.Вывести(ШапкаМодернизацииИРемонта);
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("ОсновноеСредство"   , Ссылка);
	Запрос.УстановитьПараметр("ДатаСведений"       , ДатаСведений);
	Запрос.УстановитьПараметр("УсловиеМодернизаций", Перечисления.ВидыСобытийОС.Модернизация);
	Запрос.УстановитьПараметр("УсловиеРемонтов"    , Перечисления.ВидыСобытийОС.Ремонт);
	Запрос.УстановитьПараметр("ВидОперацииОС"      , Перечисления.ВидыСобытийОС.ВводВЭксплуатацию);
	Запрос.УстановитьПараметр("Организация"        , Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР КОГДА ОперацииОС.Событие.ВидСобытияОС = (&УсловиеМодернизаций) 
	|		  ТОГДА ОперацииОС.СуммаЗатратБУ ИНАЧЕ 0 КОНЕЦ) КАК СуммаЗатратМодернизаций,
	|	СУММА(ВЫБОР КОГДА ОперацииОС.Событие.ВидСобытияОС = (&УсловиеРемонтов) 
	|		  ТОГДА ОперацииОС.СуммаЗатратБУ ИНАЧЕ 0 КОНЕЦ) КАК СуммаЗатратРемонтов,
	|	ОперацииОС.Регистратор       КАК Регистратор,
	|	ОперацииОС.Период            КАК Период,
	|	ОперацииОС.Событие           КАК Операция,
	|	ОперацииОС.НомерДокумента    КАК НомерДокумента,
	|	ОперацииОС.НазваниеДокумента КАК НазваниеДокумента
	|ИЗ
	|	РегистрСведений.СобытияОСОрганизаций КАК ОперацииОС
	|
	|ГДЕ
	|	ОперацииОС.Событие.ВидСобытияОС <> &ВидОперацииОС
	|	И ОперацииОС.Период < &ДатаСведений
	|	И ОперацииОС.ОсновноеСредство = &ОсновноеСредство
	|	И ОперацииОС.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ОперацииОС.Период,
	|	ОперацииОС.Регистратор,
	|	ОперацииОС.Событие,
	|	ОперацииОС.НомерДокумента,
	|	ОперацииОС.НазваниеДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор";
	Результат = Запрос.Выполнить();
	
	
	СпособВыборки = ОбходРезультатаЗапроса.ПоГруппировкам;
	ВыборкаРегистраторов = Результат.Выбрать(СпособВыборки);
	
	Пока ВыборкаРегистраторов.Следующий() Цикл
		
		СуммаМодернизаций = ВыборкаРегистраторов.СуммаЗатратМодернизаций;
		СуммаРемонтов     = ВыборкаРегистраторов.СуммаЗатратРемонтов;
		
		Если СуммаМодернизаций <> 0 Тогда		
			
			СтрокаТаблицыМодернизаций = ТаблицаМодернизаций.Добавить();
			СтрокаТаблицыМодернизаций.Номер = ВыборкаРегистраторов.НомерДокумента;
			СтрокаТаблицыМодернизаций.Дата  = ВыборкаРегистраторов.Период;
			СтрокаТаблицыМодернизаций.Сумма = СуммаМодернизаций;
			
		КонецЕсли;
		
		Если СуммаРемонтов <> 0 Тогда		
			
			СтрокаТаблицыРемонтов = ТаблицаРемонтов.Добавить();
			СтрокаТаблицыРемонтов.Номер = ВыборкаРегистраторов.НомерДокумента;
			СтрокаТаблицыРемонтов.Дата  = ВыборкаРегистраторов.Период;
			СтрокаТаблицыРемонтов.Сумма = СуммаРемонтов;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоСтрокМодернизации = ТаблицаМодернизаций.Количество();
	КоличествоСтрокРемонтов     = ТаблицаРемонтов.Количество();
	КоличествоСтрок             = Макс(КоличествоСтрокМодернизации, 
	                                   Окр(КоличествоСтрокРемонтов / 2, 0, РежимОкругления.Окр15как20));
	СчетСтрокРемонтов           = 0;
	
	Для СчетСтрок = 0 По КоличествоСтрок-1 Цикл
		
		// строка модернизации
		Если СчетСтрок < КоличествоСтрокМодернизации Тогда
			
			СтрокаТаблицы = ТаблицаМодернизаций.Получить(СчетСтрок);
			СтрокаМодернизацииИРемонта.Параметры.ДатаМодернизации  = СтрокаТаблицы.Дата;
			СтрокаМодернизацииИРемонта.Параметры.НомерМодернизации = СтрокаТаблицы.Номер;
			СтрокаМодернизацииИРемонта.Параметры.СуммаМодернизации = СтрокаТаблицы.Сумма; 
			
		Иначе
			
			СтрокаМодернизацииИРемонта.Параметры.ДатаМодернизации  = "";
			СтрокаМодернизацииИРемонта.Параметры.НомерМодернизации = "";
			СтрокаМодернизацииИРемонта.Параметры.СуммаМодернизации = ""; 
			
		КонецЕсли;
		
		// первая подстрока ремонта
		Если СчетСтрокРемонтов < КоличествоСтрокРемонтов Тогда
			
			СтрокаМодернизации = ТаблицаРемонтов.Получить(СчетСтрокРемонтов);			
			СтрокаМодернизацииИРемонта.Параметры.ДатаРемонта  = СтрокаМодернизации.Дата;
			СтрокаМодернизацииИРемонта.Параметры.НомерРемонта = СтрокаМодернизации.Номер;
			СтрокаМодернизацииИРемонта.Параметры.СуммаРемонта = СтрокаМодернизации.Сумма;
			СчетСтрокРемонтов = СчетСтрокРемонтов + 1;
			
		Иначе
			
			СтрокаМодернизацииИРемонта.Параметры.ДатаРемонта  = "";
			СтрокаМодернизацииИРемонта.Параметры.НомерРемонта = "";
			СтрокаМодернизацииИРемонта.Параметры.СуммаРемонта = "";
			
		КонецЕсли;
		
		// вторая подстрока ремонта
		Если СчетСтрокРемонтов < КоличествоСтрокРемонтов Тогда
			
			СтрокаМодернизации = ТаблицаРемонтов.Получить(СчетСтрокРемонтов);
			СтрокаМодернизацииИРемонта.Параметры.ДатаРемонта1  = СтрокаМодернизации.Дата;
			СтрокаМодернизацииИРемонта.Параметры.НомерРемонта1 = СтрокаМодернизации.Номер;
			СтрокаМодернизацииИРемонта.Параметры.СуммаРемонта1 = СтрокаМодернизации.Сумма;
			СчетСтрокРемонтов = СчетСтрокРемонтов + 1;
			
		Иначе
			
			СтрокаМодернизацииИРемонта.Параметры.ДатаРемонта1  = "";
			СтрокаМодернизацииИРемонта.Параметры.НомерРемонта1 = "";
			СтрокаМодернизацииИРемонта.Параметры.СуммаРемонта1 = "";
			
		КонецЕсли;
		
		ТабДок.Вывести(СтрокаМодернизацииИРемонта);		
		
	КонецЦикла;
	
	Подвал.Параметры.ДатаЗаполнения = ДатаСведений;
	ТабДок.Вывести(Подвал);		
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ПолеСлева     = 5;
	ТабДок.ПолеСправа    = 5;
	ТабДок.ПолеСверху    = 0;
	ТабДок.ПолеСнизу     = 0;
	ТабДок.ОбластьПечати = ТабДок.Область(2, 2, ТабДок.ВысотаТаблицы, ТабДок.ШиринаТаблицы);
	ТабДок.ИмяПараметровПечати = "КарточкаОЗ6";
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, , , НСтр("ru='Инвентарная карточка ОС (Форма ОЗ-6)';uk='Інвентарна картка ОЗ (Форма ОЗ-6)'"));
	
КонецФункции // ПечатьОС6_2003() 

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура осуществляет печать справочника. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
// Параметры:
//  НазваниеМакета - строка, название макета.
// Возвращаемое значение:
//  Нет.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, ФормаЭлемента = Неопределено) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ОЗ6" тогда
		
		ТабДокумент = ПечатьОЗ6();
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, НСтр("ru='Инвентарная карточка ОС (Форма ОЗ-6)';uk='Інвентарна картка ОЗ (Форма ОЗ-6)'"));

КонецПроцедуры // Печать()

// Возвращает доступные варианты печати справочника.
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ОЗ6",НСтр("ru='Форма ОЗ-6';uk='Форма ОЗ-6'"));

КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.ОбъектыСтроительства") Тогда
		
		// Заполнение шапки
		Наименование       = Основание.Наименование;
		НаименованиеПолное = Основание.Наименование;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		// Заполнение шапки
		Наименование       = Основание.Наименование;
		НаименованиеПолное = Основание.НаименованиеПолное;
		
	КонецЕсли;
	
КонецПроцедуры
